test/wrk2_fission/c_fanout/result/pthread_threshold_5.log
Running 1m test @ http://130.127.133.16:32241
  1 threads and 1 connections
  Thread calibration: mean lat.: 4499.323ms, rate sampling interval: 16121ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    33.94s    14.45s    0.98m    57.65%
    Req/Sec    20.00      0.00    20.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   33.85s 
 75.000%   46.50s 
 90.000%    0.90m 
 99.000%    0.97m 
 99.900%    0.98m 
 99.990%    0.98m 
 99.999%    0.98m 
100.000%    0.98m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9019.391     0.000000            1         1.00
   13967.359     0.100000          101         1.11
   18956.287     0.200000          202         1.25
   23904.255     0.300000          302         1.43
   28901.375     0.400000          403         1.67
   33849.343     0.500000          503         2.00
   36405.247     0.550000          554         2.22
   38928.383     0.600000          604         2.50
   41451.519     0.650000          654         2.86
   44007.423     0.700000          705         3.33
   46497.791     0.750000          755         4.00
   47742.975     0.775000          780         4.44
   48955.391     0.800000          805         5.00
   50200.575     0.825000          830         5.71
   51511.295     0.850000          856         6.67
   52756.479     0.875000          881         8.00
   53346.303     0.887500          893         8.89
   54034.431     0.900000          906        10.00
   54624.255     0.912500          918        11.43
   55279.615     0.925000          931        13.33
   55934.975     0.937500          944        16.00
   56229.887     0.943750          950        17.78
   56524.799     0.950000          956        20.00
   56819.711     0.956250          962        22.86
   57180.159     0.962500          969        26.67
   57475.071     0.968750          975        32.00
   57606.143     0.971875          978        35.56
   57769.983     0.975000          981        40.00
   57901.055     0.978125          984        45.71
   58097.663     0.981250          988        53.33
   58261.503     0.984375          991        64.00
   58294.271     0.985938          992        71.11
   58392.575     0.987500          994        80.00
   58458.111     0.989062          995        91.43
   58556.415     0.990625          997       106.67
   58654.719     0.992188          999       128.00
   58654.719     0.992969          999       142.22
   58687.487     0.993750         1000       160.00
   58753.023     0.994531         1001       182.86
   58785.791     0.995313         1002       213.33
   58851.327     0.996094         1003       256.00
   58851.327     0.996484         1003       284.44
   58851.327     0.996875         1003       320.00
   58916.863     0.997266         1004       365.71
   58916.863     0.997656         1004       426.67
   58949.631     0.998047         1005       512.00
   58949.631     0.998242         1005       568.89
   58949.631     0.998437         1005       640.00
   58949.631     0.998633         1005       731.43
   58949.631     0.998828         1005       853.33
   59015.167     0.999023         1006      1024.00
   59015.167     1.000000         1006          inf
#[Mean    =    33942.379, StdDeviation   =    14448.401]
#[Max     =    58982.400, Total count    =         1006]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   49.06ms
 75.000%   49.66ms
 90.000%   50.27ms
 99.000%   52.70ms
 99.900%   70.21ms
 99.990%   88.19ms
 99.999%   88.19ms
100.000%   88.19ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      47.135     0.000000            1         1.00
      48.127     0.100000          101         1.11
      48.447     0.200000          210         1.25
      48.671     0.300000          313         1.43
      48.863     0.400000          413         1.67
      49.055     0.500000          514         2.00
      49.151     0.550000          564         2.22
      49.247     0.600000          611         2.50
      49.343     0.650000          654         2.86
      49.503     0.700000          713         3.33
      49.663     0.750000          771         4.00
      49.695     0.775000          785         4.44
      49.759     0.800000          805         5.00
      49.887     0.825000          832         5.71
      50.015     0.850000          861         6.67
      50.111     0.875000          884         8.00
      50.175     0.887500          894         8.89
      50.271     0.900000          908        10.00
      50.367     0.912500          920        11.43
      50.463     0.925000          931        13.33
      50.655     0.937500          946        16.00
      50.687     0.943750          951        17.78
      50.751     0.950000          956        20.00
      50.783     0.956250          962        22.86
      50.879     0.962500          969        26.67
      51.039     0.968750          975        32.00
      51.135     0.971875          978        35.56
      51.167     0.975000          982        40.00
      51.199     0.978125          985        45.71
      51.455     0.981250          991        53.33
      51.455     0.984375          991        64.00
      51.583     0.985938          992        71.11
      52.255     0.987500          994        80.00
      52.479     0.989062          995        91.43
      53.055     0.990625          997       106.67
      55.103     0.992188          999       128.00
      55.103     0.992969          999       142.22
      56.351     0.993750         1000       160.00
      57.439     0.994531         1001       182.86
      60.831     0.995313         1002       213.33
      62.239     0.996094         1003       256.00
      62.239     0.996484         1003       284.44
      62.239     0.996875         1003       320.00
      64.863     0.997266         1004       365.71
      64.863     0.997656         1004       426.67
      70.207     0.998047         1005       512.00
      70.207     0.998242         1005       568.89
      70.207     0.998437         1005       640.00
      70.207     0.998633         1005       731.43
      70.207     0.998828         1005       853.33
      88.191     0.999023         1006      1024.00
      88.191     1.000000         1006          inf
#[Mean    =       49.244, StdDeviation   =        1.830]
#[Max     =       88.128, Total count    =         1006]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1186 requests in 1.00m, 362.52KB read
Requests/sec:     19.76
Transfer/sec:      6.04KB